In [1]:
import numpy as np
import pandas as pd

# Часть 1. Python

In [3]:
#Напишите функцию, которая вычленяет из текста все числа и возвражает их списком
#[Клёвое решение от @IvanFlegontov]

def take_numb(my_string):
  newstr = ''.join((ch if ch in '0123456789' else ' ') for ch in my_string)
  return [int(x) for x in newstr.split()]


take_numb('I was born in 1998')  #[1998]
take_numb('She had got 5 cats and 3 kittens') #[5, 3]
take_numb('Does it really cost 500$? Or maybe 450$?') #[500, 450]

[500, 450]

In [2]:
#Напишите функцию, которая принимает на вход словарь, а возвращает все уникальные значения словаря списком

def get_distinct_dic(dic):
  return list(set(dic.values()))

get_distinct_dic({'jan':47, 'feb':52, 'march':47, 'April':44, 'May':52, 'June':53, 'july':54, 'Aug':44, 'Sept':54}) # [47, 52, 44, 53, 54]

[44, 47, 52, 53, 54]

In [6]:
#Напишите функцию, которая принимает на вход список, а возвращает все уникальные 
#значения списка + печатает минимум и максимум списка

def get_distinct_list(dic):
  print("Max is ", max(dic))
  print("Min is ", min(dic))
  return list(set(dic))

get_distinct_list([9123, 31, 1938, 9123, 1, 249, 912, 10, 31, 213, 81, 10]) # [31, 1938, 9123, 1, 249, 912, 010, 213, 81], min = 1, max = 9123

Max is  9123
Min is  1

[1, 9123, 10, 912, 81, 1938, 213, 249, 31]

In [13]:
#Выведите сколько раз в тексте встречается каждое слово (не учитывая регистр), каждый знак преминания и каждая буква

sample_test = "Гостиная Анны Павловны начала понемногу наполняться. Приехала высшая знать Петербурга, люди самые разнородные по возрастам и характерам, но одинаковые по обществу, в каком все жили; приехала дочь князя Василия, красавица Элен, заехавшая за отцом, чтобы с ним вместе ехать на праздник посланника. Она была в шифре и бальном платье. Приехала и известная, как la femme la plus séduisante de Pétersbourg 1, молодая, маленькая княгиня Болконская, прошлую зиму вышедшая замуж и теперь не выезжавшая в большой свет по причине своей беременности, но ездившая еще на небольшие вечера. Приехал князь Ипполит, сын князя Василия, с Мортемаром, которого он представил; приехал и аббат Морио и многие другие. — Вы не видали еще, — или: — вы не знакомы с ma tante? 2 — говорила Анна Павловна приезжавшим гостям и весьма серьезно подводила их к маленькой старушке в высоких бантах, выплывшей из другой комнаты, как скоро стали приезжать гости, называла их по имени, медленно переводя глаза с гостя на ma tante, и потом отходила. Все гости совершали обряд приветствования никому не известной, никому не интересной и не нужной тетушки. Анна Павловна с грустным, торжественным участием следила за их приветствиями, молчаливо одобряя их. Ma tante каждому говорила в одних и тех же выражениях о его здоровье, о своем здоровье и о здоровье ее величества, которое нынче было, слава Богу, лучше. Все подходившие, из приличия не выказывая поспешности, с чувством облегчения исполненной тяжелой обязанности отходили от старушки, чтоб уж весь вечер ни разу не подойти к ней. Молодая княгиня Болконская приехала с работой в шитом золотом бархатном мешке. Ее хорошенькая, с чуть черневшимися усиками верхняя губка была коротка по зубам, но тем милее она открывалась и тем еще милее вытягивалась иногда и опускалась на нижнюю. Как это бывает у вполне привлекательных женщин, недостаток ее — короткость губы и полуоткрытый рот — казались ее особенною, собственно ее красотой. Всем было весело смотреть на эту полную здоровья и живости хорошенькую будущую мать, так легко переносившую свое положение. Старикам и скучающим, мрачным молодым людям казалось, что они сами делаются похожи на нее, побыв и поговорив несколько времени с ней. Кто говорил с ней и видел при каждом слове ее светлую улыбочку и блестящие белые зубы, которые виднелись беспрестанно, тот думал, что он особенно нынче любезен. И это думал каждый."

#переведём в нижний регистр:
sample_test = sample_test.lower()

#самый простой способ разбить текст на символы:
list(sample_test)

#Чтобы посчитать число вхождений символов - использует counter. В рамках занятия про него не говорили, но по запросу
#"frequency of elements in list python" этот способ вылезает первой ссылкой:
import collections
print(collections.Counter(list(sample_test)))

#Чтобы посчитать встречаемость слов - сначала выбросим все знаки припинания и цифры (заменяя их на пустые значения), 
#потом посчитаем аналогично:
bad_char = ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '.', ',', ':', ';', '—', '!', '?']

for char in bad_char:
    sample_test = sample_test.replace(char, "")
print(collections.Counter(sample_test.split(' ')))

Counter({' ': 369, 'о': 201, 'е': 172, 'а': 154, 'и': 139, 'н': 131, 'т': 96, 'в': 94, 'с': 93, 'л': 89, 'р': 77, 'к': 67, 'м': 65, 'п': 52, 'я': 48, 'ы': 44, 'у': 44, 'д': 43, ',': 41, 'б': 39, 'з': 37, 'ь': 34, 'г': 27, 'х': 27, 'ш': 25, 'ч': 23, 'ж': 19, 'й': 18, '.': 17, 'ю': 14, 'a': 9, 'щ': 8, 'e': 8, 't': 8, '—': 6, 'm': 5, 'э': 4, 's': 4, 'n': 4, 'l': 3, 'u': 3, ';': 2, 'ц': 2, 'p': 2, 'é': 2, 'd': 2, 'r': 2, 'ф': 1, 'f': 1, 'i': 1, 'b': 1, 'o': 1, 'g': 1, '1': 1, ':': 1, '?': 1, '2': 1})
Counter({'и': 20, 'с': 10, '': 8, 'не': 8, 'в': 6, 'на': 6, 'ее': 6, 'по': 5, 'приехала': 4, 'их': 4, 'но': 3, 'все': 3, 'как': 3, 'еще': 3, 'ma': 3, 'tante': 3, 'о': 3, 'здоровье': 3, 'ней': 3, 'князя': 2, 'василия': 2, 'за': 2, 'она': 2, 'была': 2, 'la': 2, 'молодая': 2, 'княгиня': 2, 'болконская': 2, 'приехал': 2, 'он': 2, 'вы': 2, 'говорила': 2, 'анна': 2, 'павловна': 2, 'к': 2, 'из': 2, 'гости': 2, 'никому': 2, 'нынче': 2, 'было': 2, 'тем': 2, 'милее': 2, 'это': 2, 'что': 2, 'думал': 2, 'гостиная': 1, 'анны': 1, 'павловны': 1, 'начала': 1, 'понемногу': 1, 'наполняться': 1, 'высшая': 1, 'знать': 1, 'петербурга': 1, 'люди': 1, 'самые': 1, 'разнородные': 1, 'возрастам': 1, 'характерам': 1, 'одинаковые': 1, 'обществу': 1, 'каком': 1, 'жили': 1, 'дочь': 1, 'красавица': 1, 'элен': 1, 'заехавшая': 1, 'отцом': 1, 'чтобы': 1, 'ним': 1, 'вместе': 1, 'ехать': 1, 'праздник': 1, 'посланника': 1, 'шифре': 1, 'бальном': 1, 'платье': 1, 'известная': 1, 'femme': 1, 'plus': 1, 'séduisante': 1, 'de': 1, 'pétersbourg': 1, 'маленькая': 1, 'прошлую': 1, 'зиму': 1, 'вышедшая': 1, 'замуж': 1, 'теперь': 1, 'выезжавшая': 1, 'большой': 1, 'свет': 1, 'причине': 1, 'своей': 1, 'беременности': 1, 'ездившая': 1, 'небольшие': 1, 'вечера': 1, 'князь': 1, 'ипполит': 1, 'сын': 1, 'мортемаром': 1, 'которого': 1, 'представил': 1, 'аббат': 1, 'морио': 1, 'многие': 1, 'другие': 1, 'видали': 1, 'или': 1, 'знакомы': 1, 'приезжавшим': 1, 'гостям': 1, 'весьма': 1, 'серьезно': 1, 'подводила': 1, 'маленькой': 1, 'старушке': 1, 'высоких': 1, 'бантах': 1, 'выплывшей': 1, 'другой': 1, 'комнаты': 1, 'скоро': 1, 'стали': 1, 'приезжать': 1, 'называла': 1, 'имени': 1, 'медленно': 1, 'переводя': 1, 'глаза': 1, 'гостя': 1, 'потом': 1, 'отходила': 1, 'совершали': 1, 'обряд': 1, 'приветствования': 1, 'известной': 1, 'интересной': 1, 'нужной': 1, 'тетушки': 1, 'грустным': 1, 'торжественным': 1, 'участием': 1, 'следила': 1, 'приветствиями': 1, 'молчаливо': 1, 'одобряя': 1, 'каждому': 1, 'одних': 1, 'тех': 1, 'же': 1, 'выражениях': 1, 'его': 1, 'своем': 1, 'величества': 1, 'которое': 1, 'слава': 1, 'богу': 1, 'лучше': 1, 'подходившие': 1, 'приличия': 1, 'выказывая': 1, 'поспешности': 1, 'чувством': 1, 'облегчения': 1, 'исполненной': 1, 'тяжелой': 1, 'обязанности': 1, 'отходили': 1, 'от': 1, 'старушки': 1, 'чтоб': 1, 'уж': 1, 'весь': 1, 'вечер': 1, 'ни': 1, 'разу': 1, 'подойти': 1, 'работой': 1, 'шитом': 1, 'золотом': 1, 'бархатном': 1, 'мешке': 1, 'хорошенькая': 1, 'чуть': 1, 'черневшимися': 1, 'усиками': 1, 'верхняя': 1, 'губка': 1, 'коротка': 1, 'зубам': 1, 'открывалась': 1, 'вытягивалась': 1, 'иногда': 1, 'опускалась': 1, 'нижнюю': 1, 'бывает': 1, 'у': 1, 'вполне': 1, 'привлекательных': 1, 'женщин': 1, 'недостаток': 1, 'короткость': 1, 'губы': 1, 'полуоткрытый': 1, 'рот': 1, 'казались': 1, 'особенною': 1, 'собственно': 1, 'красотой': 1, 'всем': 1, 'весело': 1, 'смотреть': 1, 'эту': 1, 'полную': 1, 'здоровья': 1, 'живости': 1, 'хорошенькую': 1, 'будущую': 1, 'мать': 1, 'так': 1, 'легко': 1, 'переносившую': 1, 'свое': 1, 'положение': 1, 'старикам': 1, 'скучающим': 1, 'мрачным': 1, 'молодым': 1, 'людям': 1, 'казалось': 1, 'они': 1, 'сами': 1, 'делаются': 1, 'похожи': 1, 'нее': 1, 'побыв': 1, 'поговорив': 1, 'несколько': 1, 'времени': 1, 'кто': 1, 'говорил': 1, 'видел': 1, 'при': 1, 'каждом': 1, 'слове': 1, 'светлую': 1, 'улыбочку': 1, 'блестящие': 1, 'белые': 1, 'зубы': 1, 'которые': 1, 'виднелись': 1, 'беспрестанно': 1, 'тот': 1, 'особенно': 1, 'любезен': 1, 'каждый': 1})

# Часть 2. Numpy

In [ ]:
#Реализуйте функции, которые будут считать следующие расстояние между векторами:

#Решение @eugeneshar, размерности проверять - очень круто!

#1. Евклидово расстояние
def euclid(x, y):
    if len(x) == len(y):
        return np.linalg.norm(x-y)
    else:
        print('Vectors have different dimensions')
        return -1
    
    
#2. Хеммингово расстояние
def hamming(x, y):
    if len(x) == len(y):
        return np.sum(np.abs(x-y))
    else:
        print('Vectors have different dimensions')
        return -1
#3. Расстояние Чебышева
def chebyshev(x, y):
    if len(x) == len(y):
        return np.max(np.abs(x-y))
    else:
        print('Vectors have different dimensions')
        return -1
# Вектора в функцию подаются как numpy.array.

# Часть 3. Pandas

In [14]:
#Считайте датасет из файла train.csv - это данные о выживаемости на Титанике
df = pd.read_csv("train.csv")
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [15]:
#Выведите основную информацию о датасете - число пропусков, средние значения и т.д. 
df.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [21]:
#Посчитайте процент выживаемости у каждого класса пассажиров (Pclass) 
df.groupby("Pclass")[['Survived']].mean()*100

         Survived
Pclass
1       62.962963
2       47.282609
3       24.236253

In [22]:
#Посчитайте процнт выживаемости для мужчин и женщин
df.groupby("Sex")[['Survived']].mean()*100

         Survived
Sex
female  74.203822
male    18.890815

In [28]:
#Выведите самое популярное мужское и самое популярное женское имя на корабле
#Опять же, очень красивое решение от @eugeneshar:
def get_name(string):
    try:
        if '(' in string:
            names = string.split('(')[1]
            name = names.split(' ')[0]
            return name
        else:
            names = string.split('.')[1]
            name = names.split(' ')[1]
            return name
    except:
        return 'Eugene'

df['given_name'] = df['Name'].apply(get_name)

In [33]:
df.loc[df['Sex'] == 'female', 'given_name'].value_counts().idxmax()

'Anna'

In [34]:
df.loc[df['Sex'] == 'male', 'given_name'].value_counts().idxmax()

'William'

In [36]:
#Выведите самое популярное мужское и самое популярное женское имя на корабле в каждом классе
df.groupby(['Pclass', 'Sex'])['given_name'].value_counts().groupby(['Pclass', 'Sex']).idxmax()

Pclass  Sex
1       female    (1, female, Elizabeth)
        male          (1, male, William)
2       female    (2, female, Elizabeth)
        male          (2, male, William)
3       female         (3, female, Anna)
        male          (3, male, William)
Name: given_name, dtype: object

In [44]:
#Выведите количества n-местных кабин (в которых было 2, 3, 4, ... человека)
df.groupby("Cabin")['Cabin'].count().value_counts()

1    101
2     38
3      5
4      3
Name: Cabin, dtype: int64

In [47]:
#Выведите часть таблицы с пассажирами, возраст которых больше 44 лет.
df[df["Age"] > 44].head()

    PassengerId  Survived  Pclass  ... Cabin Embarked  given_name
6             7         0       1  ...   E46        S     Timothy
11           12         1       1  ...  C103        S   Elizabeth
15           16         1       2  ...   NaN        S        Mary
33           34         0       2  ...   NaN        S      Edward
52           53         1       1  ...   D33        C        Myna

[5 rows x 13 columns]

In [48]:
#Выведите часть таблицы с пассажирами, возраст которых меньше 44 лет и которые мужского пола.
df[(df["Age"] < 44) & (df["Sex"] == "male")].head()

    PassengerId  Survived  Pclass  ... Cabin Embarked  given_name
0             1         0       3  ...   NaN        S        Owen
4             5         0       3  ...   NaN        S     William
7             8         0       3  ...   NaN        S       Gosta
12           13         0       3  ...   NaN        S     William
13           14         0       3  ...   NaN        S      Anders

[5 rows x 13 columns]